tutorials/flatPlate/0.orig/anisotropyK
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      anisotropyK;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (1 0 0 0 1 0 0 0 1);

boundaryField
{
    top
    {
        type            calculated;
        value           uniform (1 0 0 0 1 0 0 0 1);
    }
    bottom
    {
        type            calculated;
        value           uniform (1 0 0 0 1 0 0 0 1);
    }
    inlet_porous
    {
        type            calculated;
        value           uniform (1 0 0 0 1 0 0 0 1);
    }
    inlet
    {
        type            calculated;
        value           uniform (1 0 0 0 1 0 0 0 1);
    }
    outlet
    {
        type            calculated;
        value           uniform (1 0 0 0 1 0 0 0 1);
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
