tutorials/flatPlate/constant/solidThermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      ascii;
    class       dictionary;
    object      solidThermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType solidMixtureThermo<constHeterogeneous>;

solidComponents
(
    porousMaterial
);

porousMaterialCoeffs
{
    transport
    {
        K           0.2;
    }
    thermodynamics
    {
        Cp          1500;
        Hf          -2.12e4;
    }
    density
    {
      rho          630;
    }
};

// ************************************************************************* //
