tutorials/flatPlate/constant/thermo.compressibleGas
(
N2 N2   1   28.0134
    200 5000    1000
    2.92664 0.00148798 -5.68476e-07 1.0097e-10 -6.75335e-15 -922.798 5.98053
    3.29868 0.00140824 -3.96322e-06 5.64152e-09 -2.44486e-12 -1020.9 3.95037
    1.67212e-06 170.672
O2 O2- 1       31.9993
    200 5000    1000
    3.88301 0.000740787 -2.96178e-07 5.7243e-11 -4.08655e-15 -7121.64 2.65821
    2.87229 0.00335972 -2.66489e-06 9.80752e-10 -1.67096e-13 -6829.09 7.93837
    1.67212e-06     170.672
)

