tutorials/flatPlate/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    system;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat raw;

surfaceFormat raw;

interpolationScheme cellPointFace;

fields
(
    T
    Ts
    N2
    O2
    porosityF
    maggradUx
    Ux
    alpha
    mu
    rho
    gradT
    gradUx
);

sets
(
    lineX1
    {
        type        midPointAndFace;
        axis        xyz;

        start       (0.25  0    1e-3);
        end         (0.25  0.5  1e-3);
        nPoints     500;
    }

    lineX2
    {
        type        midPointAndFace;
        axis        xyz;

        start       (0.5  0    1e-3);
        end         (0.5  0.5  1e-3);
        nPoints     500;
    }

    lineX3
    {
        type        midPointAndFace;
        axis        xyz;

        start       (0.75  0    1e-3);
        end         (0.75  0.5  1e-3);
        nPoints     500;
    }

);

surfaces
(
);

// *********************************************************************** //
